### Import data

In [123]:
import pandas as pd

file= pd.read_csv("C:/Users/Administrateur/Desktop/mes_idfno2.csv",encoding= 'unicode_escape',delimiter=";",parse_dates=True)

In [124]:
file.head()

,id,nom_dept,nom_com,id_com,nom_statio,code_stati,typologie,nom_poll,id_poll_ue,valeur,unite,metrique,date_debut,date_fin,statut_val,x,y
0,1,PARIS,PARIS-6E-ARRONDISSEMENT,75106,Rue Bonaparte,4071,Trafic,NO2,8,"73,000000000000000",ug.m-3,horaire,18/09/2017,18/09/2017,1,651166,6862011
1,2,PARIS,PARIS-6E-ARRONDISSEMENT,75106,Rue Bonaparte,4071,Trafic,NO2,8,"57,000000000000000",ug.m-3,horaire,18/09/2017,18/09/2017,1,651166,6862011
2,3,PARIS,PARIS-6E-ARRONDISSEMENT,75106,Rue Bonaparte,4071,Trafic,NO2,8,"65,000000000000000",ug.m-3,horaire,18/09/2017,18/09/2017,1,651166,6862011
3,4,PARIS,PARIS-6E-ARRONDISSEMENT,75106,Rue Bonaparte,4071,Trafic,NO2,8,"81,000000000000000",ug.m-3,horaire,18/09/2017,18/09/2017,1,651166,6862011
4,5,PARIS,PARIS-6E-ARRONDISSEMENT,75106,Rue Bonaparte,4071,Trafic,NO2,8,"74,000000000000000",ug.m-3,horaire,18/09/2017,18/09/2017,1,651166,6862011

### select columns

In [125]:
file_no2=file[["nom_dept","nom_com","id_com","valeur","date_debut","date_fin"]]
file_no2.head()

,nom_dept,nom_com,id_com,valeur,date_debut,date_fin
0,PARIS,PARIS-6E-ARRONDISSEMENT,75106,"73,000000000000000",18/09/2017,18/09/2017
1,PARIS,PARIS-6E-ARRONDISSEMENT,75106,"57,000000000000000",18/09/2017,18/09/2017
2,PARIS,PARIS-6E-ARRONDISSEMENT,75106,"65,000000000000000",18/09/2017,18/09/2017
3,PARIS,PARIS-6E-ARRONDISSEMENT,75106,"81,000000000000000",18/09/2017,18/09/2017
4,PARIS,PARIS-6E-ARRONDISSEMENT,75106,"74,000000000000000",18/09/2017,18/09/2017

### Show district

In [126]:
file_no2["id_com"].value_counts()

78646    26727
94081    26465
77258    26458
95088    26404
95277    26404
93073    26384
95633    26332
95612    26308
92036    26239
75106    26116
75112    25930
91228    25784
93066    25559
75115    24715
75102    24705
75104    16770
Name: id_com, dtype: int64

In [127]:
file_no2["nom_dept"].value_counts()

PARIS                118236
VAL-D'OISE           105448
SEINE-SAINT-DENIS     51943
YVELINES              26727
VAL-DE-MARNE          26465
SEINE-ET-MARNE        26458
HAUTS-DE-SEINE        26239
ESSONNE               25784
Name: nom_dept, dtype: int64

### Select Paris districs

In [128]:
file_no2=file_no2[file_no2["nom_dept"]=="PARIS"]

In [129]:
file_no2["nom_dept"].value_counts()

PARIS    118236
Name: nom_dept, dtype: int64

In [130]:
file_no2["id_com"].value_counts()

75106    26116
75112    25930
75115    24715
75102    24705
75104    16770
Name: id_com, dtype: int64

In [131]:
#
file_no2=file[["id_com","valeur","date_fin"]]
file_no2.head()

   id_com              valeur    date_fin
0   75106  73,000000000000000  18/09/2017
1   75106  57,000000000000000  18/09/2017
2   75106  65,000000000000000  18/09/2017
3   75106  81,000000000000000  18/09/2017
4   75106  74,000000000000000  18/09/2017

### format number of traffic (value)

In [132]:
file_no2["valeur"]=file_no2["valeur"].apply(lambda x:x.split(",")[0])

<ipython-input-132-7948bfc1ac29>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  file_no2["valeur"]=file_no2["valeur"].apply(lambda x:x.split(",")[0])

### format date

In [133]:
file_no2['date_fin']=pd.to_datetime(file_no2['date_fin'].astype(str), format='%d/%m/%Y')

<ipython-input-133-ff4981babbd5>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  file_no2['date_fin']=pd.to_datetime(file_no2['date_fin'].astype(str), format='%d/%m/%Y')

In [134]:
file_no2.columns=['zip_code','no2',"date"]
file_no2.tail()

        zip_code no2       date
407295     92036  19 2020-11-19
407296     92036  24 2020-11-19
407297     92036  21 2020-11-19
407298     92036  14 2020-11-19
407299     92036  10 2020-11-19

### Select date between 01/10/2019 to 19/11/2020

In [135]:
file_no2.shape

(407300, 3)

In [136]:
file_no2["date"].max()

Timestamp('2020-11-19 00:00:00')

In [137]:
file_no2["date"].min()

Timestamp('2017-09-18 00:00:00')

In [138]:
df=file_no2[file_no2["date"]>="01/10/2019"]

In [139]:
df.shape

(230939, 3)

In [140]:
df["date"].max()

Timestamp('2020-11-19 00:00:00')

In [141]:
df["date"].min()

Timestamp('2019-01-10 00:00:00')

In [142]:
df.to_csv("C:/Users/Administrateur/Documents/bike_project/pollution_no2.csv", sep=";", encoding="utf-8")

### exemple final csv

In [151]:
# save dataset to csv 
df=pd.read_csv("C:/Users/Administrateur/Documents/bike_project/pollution_no2.csv", delimiter=";",index_col=0)
df.tail()

        zip_code  no2        date
407295     92036   19  2020-11-19
407296     92036   24  2020-11-19
407297     92036   21  2020-11-19
407298     92036   14  2020-11-19
407299     92036   10  2020-11-19

In [152]:
df["zip_code"].value_counts()

95088    15538
95277    15538
95633    15466
95612    15442
78646    15410
92036    15290
93073    15246
94081    15191
77258    15180
75112    15002
75106    14926
93066    14579
91228    14436
75115    14120
75102    14073
75104     5502
Name: zip_code, dtype: int64

### format zip code

In [153]:
df["zip_code"]=df["zip_code"].apply(lambda x:str(x))

In [155]:
df["zip_code"]=df["zip_code"].apply(lambda x:"7500"+x[-1])

In [156]:
df["zip_code"]=df["zip_code"].apply(lambda x:"750"+ x[3:5])
#file_adresse1["zip_code"]=file_adresse1["C_AR"].apply(lambda x:int(x)+75000)
df.head()

       zip_code  no2        date
176151    75006   31  2019-01-10
176152    75006   28  2019-01-10
176153    75006   27  2019-01-10
176154    75006   27  2019-01-10
176155    75006   36  2019-01-10

In [157]:
df["zip_code"].value_counts()

75006    60205
75008    45154
75002    44517
75003    30712
75007    15538
75001    15191
75005    14120
75004     5502
Name: zip_code, dtype: int64

### GroupBY

In [148]:
df["no2"]=df["no2"].apply(lambda x:int(x))